zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TENBASET_PHY.h
/*
** ###################################################################
**     Processors:          MCXA286VASR
**                          MCXA286VLL
**                          MCXA286VLQ
**                          MCXA286VPN
**                          MCXA287VASR
**                          MCXA287VLL
**                          MCXA287VLQ
**                          MCXA287VPN
**                          MCXA456VASR
**                          MCXA456VLL
**                          MCXA456VLQ
**                          MCXA456VPN
**                          MCXA457VASR
**                          MCXA457VLL
**                          MCXA457VLQ
**                          MCXA457VPN
**                          MCXA536VLL
**                          MCXA536VLQ
**                          MCXA536VPN
**                          MCXA537VLL
**                          MCXA537VLQ
**                          MCXA537VPN
**                          MCXA556BVPN
**                          MCXA556VPN
**                          MCXA557BVPN
**                          MCXA557VPN
**                          MCXA566VLL
**                          MCXA566VLQ
**                          MCXA566VPN
**                          MCXA567VLL
**                          MCXA567VLQ
**                          MCXA567VPN
**                          MCXA577VLL
**                          MCXA577VLQ
**                          MCXA577VPN
**
**     Version:             rev. 2.0, 2024-10-29
**     Build:               b260708
**
**     Abstract:
**         CMSIS Peripheral Access Layer for TENBASET_PHY
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2024-03-26)
**         Initial version based on Rev1 DraftC RM
**     - rev. 2.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_TENBASET_PHY.h
 * @version 2.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for TENBASET_PHY
 *
 * CMSIS Peripheral Access Layer for TENBASET_PHY
 */

#if !defined(PERI_TENBASET_PHY_H_)
#define PERI_TENBASET_PHY_H_                     /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXA286VASR) || defined(CPU_MCXA286VLL) || defined(CPU_MCXA286VLQ) || defined(CPU_MCXA286VPN))
#include "MCXA286_COMMON.h"
#elif (defined(CPU_MCXA287VASR) || defined(CPU_MCXA287VLL) || defined(CPU_MCXA287VLQ) || defined(CPU_MCXA287VPN))
#include "MCXA287_COMMON.h"
#elif (defined(CPU_MCXA456VASR) || defined(CPU_MCXA456VLL) || defined(CPU_MCXA456VLQ) || defined(CPU_MCXA456VPN))
#include "MCXA456_COMMON.h"
#elif (defined(CPU_MCXA457VASR) || defined(CPU_MCXA457VLL) || defined(CPU_MCXA457VLQ) || defined(CPU_MCXA457VPN))
#include "MCXA457_COMMON.h"
#elif (defined(CPU_MCXA536VLL) || defined(CPU_MCXA536VLQ) || defined(CPU_MCXA536VPN))
#include "MCXA536_COMMON.h"
#elif (defined(CPU_MCXA537VLL) || defined(CPU_MCXA537VLQ) || defined(CPU_MCXA537VPN))
#include "MCXA537_COMMON.h"
#elif (defined(CPU_MCXA556BVPN) || defined(CPU_MCXA556VPN))
#include "MCXA556_COMMON.h"
#elif (defined(CPU_MCXA557BVPN) || defined(CPU_MCXA557VPN))
#include "MCXA557_COMMON.h"
#elif (defined(CPU_MCXA566VLL) || defined(CPU_MCXA566VLQ) || defined(CPU_MCXA566VPN))
#include "MCXA566_COMMON.h"
#elif (defined(CPU_MCXA567VLL) || defined(CPU_MCXA567VLQ) || defined(CPU_MCXA567VPN))
#include "MCXA567_COMMON.h"
#elif (defined(CPU_MCXA577VLL) || defined(CPU_MCXA577VLQ) || defined(CPU_MCXA577VPN))
#include "MCXA577_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- TENBASET_PHY Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TENBASET_PHY_Peripheral_Access_Layer TENBASET_PHY Peripheral Access Layer
 * @{
 */

/** TENBASET_PHY - Register Layout Typedef */
typedef struct {
  __IO uint16_t PHYCTRL;                           /**< PHY control, offset: 0x0 */
  __I  uint16_t PHYSTAT;                           /**< PHY status, offset: 0x2 */
  __I  uint16_t PHYID0;                            /**< PHY Identifier0, offset: 0x4 */
  __I  uint16_t PHYID1;                            /**< PHY Identifier1, offset: 0x6 */
       uint8_t RESERVED_0[60];
  __I  uint16_t BASE1EXT;                          /**< PHY BASE-T1 Extended, offset: 0x44 */
       uint8_t RESERVED_1[34];
  __I  uint16_t PMAPMDCTRL;                        /**< PMA/PMD Control, offset: 0x68 */
       uint8_t RESERVED_2[40];
  __IO uint16_t PMACTRL;                           /**< PMA CTRL, offset: 0x92 */
  __I  uint16_t PMASTAT;                           /**< PMA Status, offset: 0x94 */
  __IO uint16_t PMATM;                             /**< PMA Test Mode, offset: 0x96 */
       uint8_t RESERVED_3[14];
  __IO uint16_t PCSCTRL;                           /**< PCS Control, offset: 0xA6 */
  __I  uint16_t PCSSTAT;                           /**< PCS Status, offset: 0xA8 */
  __I  uint16_t PCSDIAG1;                          /**< PCS Remote Jabber Counter, offset: 0xAA */
  __I  uint16_t PCSDIAG2;                          /**< PCS Physical Collisions Counter, offset: 0xAC */
       uint8_t RESERVED_4[18];
  __I  uint16_t PLCAIDVER;                         /**< PLCA Identification and Version, offset: 0xC0 */
  __IO uint16_t PLCACTRL0;                         /**< PLCA Control0, offset: 0xC2 */
  __IO uint16_t PLCACTRL1;                         /**< PLCA Control1, offset: 0xC4 */
  __I  uint16_t PLCASTAT;                          /**< PLCA Status, offset: 0xC6 */
  __IO uint16_t PLCATOTMR;                         /**< PLCA Transmit Opportunity Timer, offset: 0xC8 */
  __IO uint16_t PLCABURST;                         /**< PLCA Burst Mode Configuration, offset: 0xCA */
  __I  uint16_t PLCARECST;                         /**< PLCA Status, offset: 0xCC */
       uint8_t RESERVED_5[50];
  __IO uint16_t MODECTRL;                          /**< MODE Control, offset: 0x100 */
  __IO uint16_t MODECFG;                           /**< Mode Configuration, offset: 0x102 */
  __I  uint16_t MODESTAT;                          /**< Mode Status, offset: 0x104 */
       uint8_t RESERVED_6[26];
  __IO uint16_t WKCTRL;                            /**< Wake Control, offset: 0x120 */
  __IO uint16_t WKCFG;                             /**< Wake Configuration, offset: 0x122 */
       uint8_t RESERVED_7[2];
  __IO uint16_t WUPCTRL;                           /**< Wake Control, offset: 0x126 */
  __IO uint16_t WUPCFG;                            /**< Wakeup Configuration, offset: 0x128 */
  __I  uint16_t WUPSTAT;                           /**< Wakeup Status, offset: 0x12A */
       uint8_t RESERVED_8[20];
  __IO uint16_t SMIDATA;                           /**< SMI Frame DATA, offset: 0x140 */
  __IO uint16_t SMICTRL;                           /**< SMI Control, offset: 0x142 */
  __IO uint16_t SMICFG;                            /**< SMI Configuration, offset: 0x144 */
  __I  uint16_t SMISTAT;                           /**< SMI Status, offset: 0x146 */
       uint8_t RESERVED_9[24];
  __IO uint16_t INTENCAPT1;                        /**< Interrupt Capture1, offset: 0x160 */
  __IO uint16_t INTENSET1;                         /**< Interrupt Enable Set1, offset: 0x162 */
  __IO uint16_t INTENCLR1;                         /**< Interrupt Enable Clear1, offset: 0x164 */
  __I  uint16_t INTSTAT1;                          /**< Interrupt Status1, offset: 0x166 */
       uint8_t RESERVED_10[8];
  __IO uint16_t INTENCAPT2;                        /**< Interrupt Capture2, offset: 0x170 */
  __IO uint16_t INTENSET2;                         /**< Interrupt Enable Set1, offset: 0x172 */
  __IO uint16_t INTENCLR2;                         /**< Interrupt Enable Clear2, offset: 0x174 */
  __I  uint16_t INTSTAT2;                          /**< Interrupt Status2, offset: 0x176 */
       uint8_t RESERVED_11[40];
  __IO uint16_t PLCADIAG1;                         /**< PLCA TC14 Adv diagnostics, offset: 0x1A0 */
  __IO uint16_t PLCADIAG2;                         /**< PLCA NXP prop diagnostics, offset: 0x1A2 */
  __IO uint16_t PLCADIAG3;                         /**< PLCA Beacon Counter Diagnostics, offset: 0x1A4 */
  __IO uint16_t PLCADIAG4;                         /**< PLCA TO Counter Diagnostics, offset: 0x1A6 */
  __IO uint16_t TXCDIAG;                           /**< Transceiver Diagnostics, offset: 0x1A8 */
       uint8_t RESERVED_12[6];
  __IO uint16_t MSKPLCADIAG1;                      /**< Mask Control PLCADIAG1 Flag, offset: 0x1B0 */
  __IO uint16_t MSKPLCADIAG2;                      /**< Mask Control PLCADIAG2 Flags, offset: 0x1B2 */
  __IO uint16_t MSKTXCDIAG;                        /**< Mask Control TXCDIAG Flag, offset: 0x1B4 */
       uint8_t RESERVED_13[42];
  __IO uint16_t ACCESSCTRL;                        /**< Global Access Control, offset: 0x1E0 */
  __IO uint16_t DBGCTRL;                           /**< Debug Control, offset: 0x1E2 */
       uint8_t RESERVED_14[26];
  __I  uint16_t VERSION;                           /**< Version Information, offset: 0x1FE */
} TENBASET_PHY_Type;

/* ----------------------------------------------------------------------------
   -- TENBASET_PHY Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TENBASET_PHY_Register_Masks TENBASET_PHY Register Masks
 * @{
 */

/*! @name PHYCTRL - PHY control */
/*! @{ */

#define TENBASET_PHY_PHYCTRL_SPD1_MASK           (0x40U)
#define TENBASET_PHY_PHYCTRL_SPD1_SHIFT          (6U)
/*! SPD1 - Speed Selection1 */
#define TENBASET_PHY_PHYCTRL_SPD1(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYCTRL_SPD1_SHIFT)) & TENBASET_PHY_PHYCTRL_SPD1_MASK)

#define TENBASET_PHY_PHYCTRL_CTEST_MASK          (0x80U)
#define TENBASET_PHY_PHYCTRL_CTEST_SHIFT         (7U)
/*! CTEST - Collision Test */
#define TENBASET_PHY_PHYCTRL_CTEST(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYCTRL_CTEST_SHIFT)) & TENBASET_PHY_PHYCTRL_CTEST_MASK)

#define TENBASET_PHY_PHYCTRL_DUPLX_MASK          (0x100U)
#define TENBASET_PHY_PHYCTRL_DUPLX_SHIFT         (8U)
/*! DUPLX - Duplex Mode */
#define TENBASET_PHY_PHYCTRL_DUPLX(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYCTRL_DUPLX_SHIFT)) & TENBASET_PHY_PHYCTRL_DUPLX_MASK)

#define TENBASET_PHY_PHYCTRL_SPD0_MASK           (0x2000U)
#define TENBASET_PHY_PHYCTRL_SPD0_SHIFT          (13U)
/*! SPD0 - Speed Selection0 */
#define TENBASET_PHY_PHYCTRL_SPD0(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYCTRL_SPD0_SHIFT)) & TENBASET_PHY_PHYCTRL_SPD0_MASK)

#define TENBASET_PHY_PHYCTRL_RESET_MASK          (0x8000U)
#define TENBASET_PHY_PHYCTRL_RESET_SHIFT         (15U)
/*! RESET - RESET */
#define TENBASET_PHY_PHYCTRL_RESET(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYCTRL_RESET_SHIFT)) & TENBASET_PHY_PHYCTRL_RESET_MASK)
/*! @} */

