zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TENBASET_PHY.h
/*! @name PHYSTAT - PHY status */
/*! @{ */

#define TENBASET_PHY_PHYSTAT_LJAB_MASK           (0x2U)
#define TENBASET_PHY_PHYSTAT_LJAB_SHIFT          (1U)
/*! LJAB - Local Jabber */
#define TENBASET_PHY_PHYSTAT_LJAB(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYSTAT_LJAB_SHIFT)) & TENBASET_PHY_PHYSTAT_LJAB_MASK)

#define TENBASET_PHY_PHYSTAT_RJAB_MASK           (0x10U)
#define TENBASET_PHY_PHYSTAT_RJAB_SHIFT          (4U)
/*! RJAB - Remote Jabber */
#define TENBASET_PHY_PHYSTAT_RJAB(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYSTAT_RJAB_SHIFT)) & TENBASET_PHY_PHYSTAT_RJAB_MASK)
/*! @} */

/*! @name PHYID0 - PHY Identifier0 */
/*! @{ */

#define TENBASET_PHY_PHYID0_OUI_03_18_MASK       (0xFFFFU)
#define TENBASET_PHY_PHYID0_OUI_03_18_SHIFT      (0U)
/*! OUI_03_18 - Organizationally Unique Identifier */
#define TENBASET_PHY_PHYID0_OUI_03_18(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYID0_OUI_03_18_SHIFT)) & TENBASET_PHY_PHYID0_OUI_03_18_MASK)
/*! @} */

/*! @name PHYID1 - PHY Identifier1 */
/*! @{ */

#define TENBASET_PHY_PHYID1_ICREVISION_MASK      (0xFU)
#define TENBASET_PHY_PHYID1_ICREVISION_SHIFT     (0U)
/*! ICREVISION - IC Model Revision */
#define TENBASET_PHY_PHYID1_ICREVISION(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYID1_ICREVISION_SHIFT)) & TENBASET_PHY_PHYID1_ICREVISION_MASK)

#define TENBASET_PHY_PHYID1_ICMODEL_MASK         (0x3F0U)
#define TENBASET_PHY_PHYID1_ICMODEL_SHIFT        (4U)
/*! ICMODEL - IC Model Identifier */
#define TENBASET_PHY_PHYID1_ICMODEL(x)           (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYID1_ICMODEL_SHIFT)) & TENBASET_PHY_PHYID1_ICMODEL_MASK)

#define TENBASET_PHY_PHYID1_OUI_19_24_MASK       (0xFC00U)
#define TENBASET_PHY_PHYID1_OUI_19_24_SHIFT      (10U)
/*! OUI_19_24 - Organizationally Unique Identifier */
#define TENBASET_PHY_PHYID1_OUI_19_24(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYID1_OUI_19_24_SHIFT)) & TENBASET_PHY_PHYID1_OUI_19_24_MASK)
/*! @} */

/*! @name BASE1EXT - PHY BASE-T1 Extended */
/*! @{ */

#define TENBASET_PHY_BASE1EXT_BASET1EXT_BIT_MASK (0xFFFFU)
#define TENBASET_PHY_BASE1EXT_BASET1EXT_BIT_SHIFT (0U)
/*! BASET1EXT_BIT - Capability Info */
#define TENBASET_PHY_BASE1EXT_BASET1EXT_BIT(x)   (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_BASE1EXT_BASET1EXT_BIT_SHIFT)) & TENBASET_PHY_BASE1EXT_BASET1EXT_BIT_MASK)
/*! @} */

/*! @name PMAPMDCTRL - PMA/PMD Control */
/*! @{ */

#define TENBASET_PHY_PMAPMDCTRL_TYPE_MASK        (0xFU)
#define TENBASET_PHY_PMAPMDCTRL_TYPE_SHIFT       (0U)
/*! TYPE - Type
 *  0b0000..CBT1
 *  0b0001..MBT1
 *  0b0010..XBT1L
 *  0b0011..XBT1S
 */
#define TENBASET_PHY_PMAPMDCTRL_TYPE(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMAPMDCTRL_TYPE_SHIFT)) & TENBASET_PHY_PMAPMDCTRL_TYPE_MASK)
/*! @} */

/*! @name PMACTRL - PMA CTRL */
/*! @{ */

#define TENBASET_PHY_PMACTRL_LOOP_MASK           (0x1U)
#define TENBASET_PHY_PMACTRL_LOOP_SHIFT          (0U)
/*! LOOP - Loop
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define TENBASET_PHY_PMACTRL_LOOP(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMACTRL_LOOP_SHIFT)) & TENBASET_PHY_PMACTRL_LOOP_MASK)

#define TENBASET_PHY_PMACTRL_MULT_MASK           (0x400U)
#define TENBASET_PHY_PMACTRL_MULT_SHIFT          (10U)
/*! MULT - Multidrop Configuration */
#define TENBASET_PHY_PMACTRL_MULT(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMACTRL_MULT_SHIFT)) & TENBASET_PHY_PMACTRL_MULT_MASK)

#define TENBASET_PHY_PMACTRL_TXDIS_MASK          (0x4000U)
#define TENBASET_PHY_PMACTRL_TXDIS_SHIFT         (14U)
/*! TXDIS - Transmission Disable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define TENBASET_PHY_PMACTRL_TXDIS(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMACTRL_TXDIS_SHIFT)) & TENBASET_PHY_PMACTRL_TXDIS_MASK)

#define TENBASET_PHY_PMACTRL_RST_MASK            (0x8000U)
#define TENBASET_PHY_PMACTRL_RST_SHIFT           (15U)
/*! RST - Reset */
#define TENBASET_PHY_PMACTRL_RST(x)              (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMACTRL_RST_SHIFT)) & TENBASET_PHY_PMACTRL_RST_MASK)
/*! @} */

/*! @name PMASTAT - PMA Status */
/*! @{ */

#define TENBASET_PHY_PMASTAT_RJAB_MASK           (0x2U)
#define TENBASET_PHY_PMASTAT_RJAB_SHIFT          (1U)
/*! RJAB - RJAB Alias */
#define TENBASET_PHY_PMASTAT_RJAB(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMASTAT_RJAB_SHIFT)) & TENBASET_PHY_PMASTAT_RJAB_MASK)

#define TENBASET_PHY_PMASTAT_RFLTA_MASK          (0x200U)
#define TENBASET_PHY_PMASTAT_RFLTA_SHIFT         (9U)
/*! RFLTA - Receive Fault Advertises */
#define TENBASET_PHY_PMASTAT_RFLTA(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMASTAT_RFLTA_SHIFT)) & TENBASET_PHY_PMASTAT_RFLTA_MASK)

#define TENBASET_PHY_PMASTAT_MULTA_MASK          (0x400U)
#define TENBASET_PHY_PMASTAT_MULTA_SHIFT         (10U)
/*! MULTA - Multidrop Advertises */
#define TENBASET_PHY_PMASTAT_MULTA(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMASTAT_MULTA_SHIFT)) & TENBASET_PHY_PMASTAT_MULTA_MASK)

#define TENBASET_PHY_PMASTAT_LPWA_MASK           (0x800U)
#define TENBASET_PHY_PMASTAT_LPWA_SHIFT          (11U)
/*! LPWA - Low Power Advertise */
#define TENBASET_PHY_PMASTAT_LPWA(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMASTAT_LPWA_SHIFT)) & TENBASET_PHY_PMASTAT_LPWA_MASK)

#define TENBASET_PHY_PMASTAT_LOOPA_MASK          (0x2000U)
#define TENBASET_PHY_PMASTAT_LOOPA_SHIFT         (13U)
/*! LOOPA - Loopback Advertise */
#define TENBASET_PHY_PMASTAT_LOOPA(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMASTAT_LOOPA_SHIFT)) & TENBASET_PHY_PMASTAT_LOOPA_MASK)
/*! @} */

/*! @name PMATM - PMA Test Mode */
/*! @{ */

#define TENBASET_PHY_PMATM_PATTERN_MASK          (0xE000U)
#define TENBASET_PHY_PMATM_PATTERN_SHIFT         (13U)
/*! PATTERN - Pattern
 *  0b000..NONE
 *  0b001..TM1
 *  0b010..TM2
 *  0b011..TM3
 *  0b100..TM4
 *  0b101..RES0
 *  0b110..RES1
 *  0b111..WUT
 */
#define TENBASET_PHY_PMATM_PATTERN(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMATM_PATTERN_SHIFT)) & TENBASET_PHY_PMATM_PATTERN_MASK)
/*! @} */

/*! @name PCSCTRL - PCS Control */
/*! @{ */

#define TENBASET_PHY_PCSCTRL_DUPLX_MASK          (0x100U)
#define TENBASET_PHY_PCSCTRL_DUPLX_SHIFT         (8U)
/*! DUPLX - Duplex */
#define TENBASET_PHY_PCSCTRL_DUPLX(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PCSCTRL_DUPLX_SHIFT)) & TENBASET_PHY_PCSCTRL_DUPLX_MASK)

#define TENBASET_PHY_PCSCTRL_LOOP_MASK           (0x4000U)
#define TENBASET_PHY_PCSCTRL_LOOP_SHIFT          (14U)
/*! LOOP - Loop
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define TENBASET_PHY_PCSCTRL_LOOP(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PCSCTRL_LOOP_SHIFT)) & TENBASET_PHY_PCSCTRL_LOOP_MASK)

#define TENBASET_PHY_PCSCTRL_RST_MASK            (0x8000U)
#define TENBASET_PHY_PCSCTRL_RST_SHIFT           (15U)
/*! RST - Reset
 *  0b0..STAT_NO_RESET
 *  0b1..STAT_RESET
 */
#define TENBASET_PHY_PCSCTRL_RST(x)              (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PCSCTRL_RST_SHIFT)) & TENBASET_PHY_PCSCTRL_RST_MASK)
/*! @} */

/*! @name PCSSTAT - PCS Status */
/*! @{ */

