zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TENBASET_PHY.h
#define TENBASET_PHY_PCSSTAT_JAB_MASK            (0x80U)
#define TENBASET_PHY_PCSSTAT_JAB_SHIFT           (7U)
/*! JAB - Jabber condition
 *  0b0..No
 *  0b1..Yes
 */
#define TENBASET_PHY_PCSSTAT_JAB(x)              (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PCSSTAT_JAB_SHIFT)) & TENBASET_PHY_PCSSTAT_JAB_MASK)
/*! @} */

/*! @name PCSDIAG1 - PCS Remote Jabber Counter */
/*! @{ */

#define TENBASET_PHY_PCSDIAG1_REMJABCNT_MASK     (0xFFFFU)
#define TENBASET_PHY_PCSDIAG1_REMJABCNT_SHIFT    (0U)
/*! REMJABCNT - Remote Jabber Counter */
#define TENBASET_PHY_PCSDIAG1_REMJABCNT(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PCSDIAG1_REMJABCNT_SHIFT)) & TENBASET_PHY_PCSDIAG1_REMJABCNT_MASK)
/*! @} */

/*! @name PCSDIAG2 - PCS Physical Collisions Counter */
/*! @{ */

#define TENBASET_PHY_PCSDIAG2_PHYCOLCNT_MASK     (0xFFFFU)
#define TENBASET_PHY_PCSDIAG2_PHYCOLCNT_SHIFT    (0U)
/*! PHYCOLCNT - Physical Collisions Counter */
#define TENBASET_PHY_PCSDIAG2_PHYCOLCNT(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PCSDIAG2_PHYCOLCNT_SHIFT)) & TENBASET_PHY_PCSDIAG2_PHYCOLCNT_MASK)
/*! @} */

/*! @name PLCAIDVER - PLCA Identification and Version */
/*! @{ */

#define TENBASET_PHY_PLCAIDVER_VER_MASK          (0xFFU)
#define TENBASET_PHY_PLCAIDVER_VER_SHIFT         (0U)
/*! VER - Version */
#define TENBASET_PHY_PLCAIDVER_VER(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCAIDVER_VER_SHIFT)) & TENBASET_PHY_PLCAIDVER_VER_MASK)

#define TENBASET_PHY_PLCAIDVER_IDM_MASK          (0xFF00U)
#define TENBASET_PHY_PLCAIDVER_IDM_SHIFT         (8U)
/*! IDM - OA memory map identifier */
#define TENBASET_PHY_PLCAIDVER_IDM(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCAIDVER_IDM_SHIFT)) & TENBASET_PHY_PLCAIDVER_IDM_MASK)
/*! @} */

/*! @name PLCACTRL0 - PLCA Control0 */
/*! @{ */

#define TENBASET_PHY_PLCACTRL0_RST_MASK          (0x4000U)
#define TENBASET_PHY_PLCACTRL0_RST_SHIFT         (14U)
/*! RST - Reset */
#define TENBASET_PHY_PLCACTRL0_RST(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCACTRL0_RST_SHIFT)) & TENBASET_PHY_PLCACTRL0_RST_MASK)

#define TENBASET_PHY_PLCACTRL0_EN_MASK           (0x8000U)
#define TENBASET_PHY_PLCACTRL0_EN_SHIFT          (15U)
/*! EN - Enable */
#define TENBASET_PHY_PLCACTRL0_EN(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCACTRL0_EN_SHIFT)) & TENBASET_PHY_PLCACTRL0_EN_MASK)
/*! @} */

/*! @name PLCACTRL1 - PLCA Control1 */
/*! @{ */

#define TENBASET_PHY_PLCACTRL1_ID_MASK           (0xFFU)
#define TENBASET_PHY_PLCACTRL1_ID_SHIFT          (0U)
/*! ID - Identifier */
#define TENBASET_PHY_PLCACTRL1_ID(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCACTRL1_ID_SHIFT)) & TENBASET_PHY_PLCACTRL1_ID_MASK)

#define TENBASET_PHY_PLCACTRL1_NCNT_MASK         (0xFF00U)
#define TENBASET_PHY_PLCACTRL1_NCNT_SHIFT        (8U)
/*! NCNT - PLCA Node count */
#define TENBASET_PHY_PLCACTRL1_NCNT(x)           (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCACTRL1_NCNT_SHIFT)) & TENBASET_PHY_PLCACTRL1_NCNT_MASK)
/*! @} */

/*! @name PLCASTAT - PLCA Status */
/*! @{ */

#define TENBASET_PHY_PLCASTAT_PST_MASK           (0x8000U)
#define TENBASET_PHY_PLCASTAT_PST_SHIFT          (15U)
/*! PST - PLCA Node status */
#define TENBASET_PHY_PLCASTAT_PST(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCASTAT_PST_SHIFT)) & TENBASET_PHY_PLCASTAT_PST_MASK)
/*! @} */

/*! @name PLCATOTMR - PLCA Transmit Opportunity Timer */
/*! @{ */

#define TENBASET_PHY_PLCATOTMR_TOTMR_MASK        (0xFFU)
#define TENBASET_PHY_PLCATOTMR_TOTMR_SHIFT       (0U)
/*! TOTMR - PLCA Transmit Opportunity */
#define TENBASET_PHY_PLCATOTMR_TOTMR(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCATOTMR_TOTMR_SHIFT)) & TENBASET_PHY_PLCATOTMR_TOTMR_MASK)
/*! @} */

/*! @name PLCABURST - PLCA Burst Mode Configuration */
/*! @{ */

#define TENBASET_PHY_PLCABURST_BTMR_MASK         (0xFFU)
#define TENBASET_PHY_PLCABURST_BTMR_SHIFT        (0U)
/*! BTMR - Burst Timer */
#define TENBASET_PHY_PLCABURST_BTMR(x)           (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCABURST_BTMR_SHIFT)) & TENBASET_PHY_PLCABURST_BTMR_MASK)

#define TENBASET_PHY_PLCABURST_MAXBC_MASK        (0xFF00U)
#define TENBASET_PHY_PLCABURST_MAXBC_SHIFT       (8U)
/*! MAXBC - Maximum Burst Count */
#define TENBASET_PHY_PLCABURST_MAXBC(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCABURST_MAXBC_SHIFT)) & TENBASET_PHY_PLCABURST_MAXBC_MASK)
/*! @} */

/*! @name PLCARECST - PLCA Status */
/*! @{ */

#define TENBASET_PHY_PLCARECST_RECST_MASK        (0x8000U)
#define TENBASET_PHY_PLCARECST_RECST_SHIFT       (15U)
/*! RECST - Recovering Status */
#define TENBASET_PHY_PLCARECST_RECST(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCARECST_RECST_SHIFT)) & TENBASET_PHY_PLCARECST_RECST_MASK)
/*! @} */

/*! @name MODECTRL - MODE Control */
/*! @{ */

#define TENBASET_PHY_MODECTRL_CMD_MASK           (0x7U)
#define TENBASET_PHY_MODECTRL_CMD_SHIFT          (0U)
/*! CMD - Set back to NONE when mode controller has entered the selected mode
 *  0b000..None
 *  0b001..Linkdown
 *  0b010..Linkup
 *  0b011..TXCCFG
 *  0b100..Low-power
 *  0b101..TXCBIST
 */
#define TENBASET_PHY_MODECTRL_CMD(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MODECTRL_CMD_SHIFT)) & TENBASET_PHY_MODECTRL_CMD_MASK)
/*! @} */

/*! @name MODECFG - Mode Configuration */
/*! @{ */

#define TENBASET_PHY_MODECFG_LCLWKENA_MASK       (0x1U)
#define TENBASET_PHY_MODECFG_LCLWKENA_SHIFT      (0U)
/*! LCLWKENA - Enable wake-up to WAITINIT mode by local-wake-event
 *  0b0..Disable
 *  0b1..Enable
 */
#define TENBASET_PHY_MODECFG_LCLWKENA(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MODECFG_LCLWKENA_SHIFT)) & TENBASET_PHY_MODECFG_LCLWKENA_MASK)

#define TENBASET_PHY_MODECFG_REMWKENA_MASK       (0x2U)
#define TENBASET_PHY_MODECFG_REMWKENA_SHIFT      (1U)
/*! REMWKENA - Enable wake-up to WAITINIT mode by remote-wake-event
 *  0b0..Disable
 *  0b1..Enable
 */
#define TENBASET_PHY_MODECFG_REMWKENA(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MODECFG_REMWKENA_SHIFT)) & TENBASET_PHY_MODECFG_REMWKENA_MASK)

