zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TENBASET_PHY.h
#define TENBASET_PHY_MODECFG_SSPWKENA_MASK       (0x4U)
#define TENBASET_PHY_MODECFG_SSPWKENA_SHIFT      (2U)
/*! SSPWKENA - Enable wake-up to WAITINIT mode by SUSPEND detection
 *  0b0..Disable
 *  0b1..Enable
 */
#define TENBASET_PHY_MODECFG_SSPWKENA(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MODECFG_SSPWKENA_SHIFT)) & TENBASET_PHY_MODECFG_SSPWKENA_MASK)
/*! @} */

/*! @name MODESTAT - Mode Status */
/*! @{ */

#define TENBASET_PHY_MODESTAT_STAT_MASK          (0xFU)
#define TENBASET_PHY_MODESTAT_STAT_SHIFT         (0U)
/*! STAT - Status power-mode sequencer
 *  0b0000..PORST
 *  0b0001..WAITINIT
 *  0b0010..Linkdown
 *  0b0011..Linkup
 *  0b0100..WAITCMDLP
 *  0b0101..Low-power
 *  0b0110..WAITCMDCFG
 *  0b0111..TXCCFG
 *  0b1000..TXCBIST
 *  0b1001..WAITSSILENTLP
 *  0b1010..WAITSILENTCFG
 */
#define TENBASET_PHY_MODESTAT_STAT(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MODESTAT_STAT_SHIFT)) & TENBASET_PHY_MODESTAT_STAT_MASK)

#define TENBASET_PHY_MODESTAT_SILENTTO_MASK      (0x10U)
#define TENBASET_PHY_MODESTAT_SILENTTO_SHIFT     (4U)
/*! SILENTTO - Silent Time-out condition
 *  0b0..No
 *  0b1..Yes
 */
#define TENBASET_PHY_MODESTAT_SILENTTO(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MODESTAT_SILENTTO_SHIFT)) & TENBASET_PHY_MODESTAT_SILENTTO_MASK)
/*! @} */

/*! @name WKCTRL - Wake Control */
/*! @{ */

#define TENBASET_PHY_WKCTRL_REMWKFDW_MASK        (0x1U)
#define TENBASET_PHY_WKCTRL_REMWKFDW_SHIFT       (0U)
/*! REMWKFDW - Command to generate a wake-forward pulse
 *  0b0..NO_EFFECT
 *  0b1..Trigger generation of a wake-forward pulse
 */
#define TENBASET_PHY_WKCTRL_REMWKFDW(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_WKCTRL_REMWKFDW_SHIFT)) & TENBASET_PHY_WKCTRL_REMWKFDW_MASK)
/*! @} */

/*! @name WKCFG - Wake Configuration */
/*! @{ */

#define TENBASET_PHY_WKCFG_REMKWKFDW_MASK        (0x1U)
#define TENBASET_PHY_WKCFG_REMKWKFDW_SHIFT       (0U)
/*! REMKWKFDW - Enable wake forwarding of a remote-wake-event
 *  0b0..DISABLED
 *  0b1..ENABLED
 */
#define TENBASET_PHY_WKCFG_REMKWKFDW(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_WKCFG_REMKWKFDW_SHIFT)) & TENBASET_PHY_WKCFG_REMKWKFDW_MASK)
/*! @} */

/*! @name WUPCTRL - Wake Control */
/*! @{ */

#define TENBASET_PHY_WUPCTRL_WUPCMD_MASK         (0x1U)
#define TENBASET_PHY_WUPCTRL_WUPCMD_SHIFT        (0U)
/*! WUPCMD - Trigger the WUP sequencer transmission
 *  0b0..NO_EFFECT
 *  0b1..Trigger WUP-sequencer
 */
#define TENBASET_PHY_WUPCTRL_WUPCMD(x)           (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_WUPCTRL_WUPCMD_SHIFT)) & TENBASET_PHY_WUPCTRL_WUPCMD_MASK)

#define TENBASET_PHY_WUPCTRL_ABORTCMD_MASK       (0x2U)
#define TENBASET_PHY_WUPCTRL_ABORTCMD_SHIFT      (1U)
/*! ABORTCMD - Abort the WUP sequencer when pending.
 *  0b0..NO_EFFECT
 *  0b1..Abort WUP-sequencer
 */
#define TENBASET_PHY_WUPCTRL_ABORTCMD(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_WUPCTRL_ABORTCMD_SHIFT)) & TENBASET_PHY_WUPCTRL_ABORTCMD_MASK)
/*! @} */

/*! @name WUPCFG - Wakeup Configuration */
/*! @{ */

#define TENBASET_PHY_WUPCFG_LCLWKWUP_MASK        (0x1U)
#define TENBASET_PHY_WUPCFG_LCLWKWUP_SHIFT       (0U)
/*! LCLWKWUP - Enable WUP transmission by local-wake-event
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define TENBASET_PHY_WUPCFG_LCLWKWUP(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_WUPCFG_LCLWKWUP_SHIFT)) & TENBASET_PHY_WUPCFG_LCLWKWUP_MASK)

#define TENBASET_PHY_WUPCFG_WUPTIMEOUT_MASK      (0xFF00U)
#define TENBASET_PHY_WUPCFG_WUPTIMEOUT_SHIFT     (8U)
/*! WUPTIMEOUT - Wakeup Timeout */
#define TENBASET_PHY_WUPCFG_WUPTIMEOUT(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_WUPCFG_WUPTIMEOUT_SHIFT)) & TENBASET_PHY_WUPCFG_WUPTIMEOUT_MASK)
/*! @} */

/*! @name WUPSTAT - Wakeup Status */
/*! @{ */

#define TENBASET_PHY_WUPSTAT_STAT_MASK           (0x3U)
#define TENBASET_PHY_WUPSTAT_STAT_SHIFT          (0U)
/*! STAT - Status
 *  0b00..IDLE
 *  0b01..WAITLINK
 *  0b10..PENDING
 *  0b11..TRANSMIT
 */
#define TENBASET_PHY_WUPSTAT_STAT(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_WUPSTAT_STAT_SHIFT)) & TENBASET_PHY_WUPSTAT_STAT_MASK)

#define TENBASET_PHY_WUPSTAT_ERRCODE_MASK        (0x1CU)
#define TENBASET_PHY_WUPSTAT_ERRCODE_SHIFT       (2U)
/*! ERRCODE - Error code
 *  0b000..NONE
 *  0b001..SWABORT
 *  0b010..MODECHG
 *  0b011..TOWM
 *  0b100..TOPD
 *  0b101..TOWP
 *  0b110..TOWA
 *  0b111..CORE
 */
#define TENBASET_PHY_WUPSTAT_ERRCODE(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_WUPSTAT_ERRCODE_SHIFT)) & TENBASET_PHY_WUPSTAT_ERRCODE_MASK)
/*! @} */

/*! @name SMIDATA - SMI Frame DATA */
/*! @{ */

#define TENBASET_PHY_SMIDATA_DATA_MASK           (0xFFFFU)
#define TENBASET_PHY_SMIDATA_DATA_SHIFT          (0U)
/*! DATA - Frame Data */
#define TENBASET_PHY_SMIDATA_DATA(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMIDATA_DATA_SHIFT)) & TENBASET_PHY_SMIDATA_DATA_MASK)
/*! @} */

/*! @name SMICTRL - SMI Control */
/*! @{ */

#define TENBASET_PHY_SMICTRL_TA_MASK             (0x3U)
#define TENBASET_PHY_SMICTRL_TA_SHIFT            (0U)
/*! TA - Turn Around */
#define TENBASET_PHY_SMICTRL_TA(x)               (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMICTRL_TA_SHIFT)) & TENBASET_PHY_SMICTRL_TA_MASK)

#define TENBASET_PHY_SMICTRL_RA_MASK             (0x7CU)
#define TENBASET_PHY_SMICTRL_RA_SHIFT            (2U)
/*! RA - Register Address */
#define TENBASET_PHY_SMICTRL_RA(x)               (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMICTRL_RA_SHIFT)) & TENBASET_PHY_SMICTRL_RA_MASK)

#define TENBASET_PHY_SMICTRL_PA_MASK             (0xF80U)
#define TENBASET_PHY_SMICTRL_PA_SHIFT            (7U)
/*! PA - PHY Address */
#define TENBASET_PHY_SMICTRL_PA(x)               (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMICTRL_PA_SHIFT)) & TENBASET_PHY_SMICTRL_PA_MASK)

#define TENBASET_PHY_SMICTRL_OP_MASK             (0x3000U)
#define TENBASET_PHY_SMICTRL_OP_SHIFT            (12U)
/*! OP - Operation
 *  0b00..WRITE_COMPERR
 *  0b01..WRITE
 *  0b10..READ
 *  0b11..READ_COMPERR
 */
#define TENBASET_PHY_SMICTRL_OP(x)               (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMICTRL_OP_SHIFT)) & TENBASET_PHY_SMICTRL_OP_MASK)

#define TENBASET_PHY_SMICTRL_ST_MASK             (0xC000U)
#define TENBASET_PHY_SMICTRL_ST_SHIFT            (14U)
/*! ST - Start */
#define TENBASET_PHY_SMICTRL_ST(x)               (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMICTRL_ST_SHIFT)) & TENBASET_PHY_SMICTRL_ST_MASK)
/*! @} */

/*! @name SMICFG - SMI Configuration */
/*! @{ */

#define TENBASET_PHY_SMICFG_SPEED_MASK           (0x7EU)
#define TENBASET_PHY_SMICFG_SPEED_SHIFT          (1U)
/*! SPEED - Speed */
#define TENBASET_PHY_SMICFG_SPEED(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMICFG_SPEED_SHIFT)) & TENBASET_PHY_SMICFG_SPEED_MASK)

#define TENBASET_PHY_SMICFG_DISPRE_MASK          (0x80U)
#define TENBASET_PHY_SMICFG_DISPRE_SHIFT         (7U)
/*! DISPRE - Disable SMI Preamble
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define TENBASET_PHY_SMICFG_DISPRE(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMICFG_DISPRE_SHIFT)) & TENBASET_PHY_SMICFG_DISPRE_MASK)

