zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TENBASET_PHY.h
#define TENBASET_PHY_SMICFG_HOLD_MASK            (0x700U)
#define TENBASET_PHY_SMICFG_HOLD_SHIFT           (8U)
/*! HOLD - Hold
 *  0b000..HOLD_1
 *  0b001..HOLD_2
 *  0b010..HOLD_3
 *  0b011..HOLD_4
 *  0b100..HOLD_5
 *  0b101..6 PCLK cycles 6
 *  0b110..HOLD_7
 *  0b111..HOLD_8
 */
#define TENBASET_PHY_SMICFG_HOLD(x)              (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMICFG_HOLD_SHIFT)) & TENBASET_PHY_SMICFG_HOLD_MASK)
/*! @} */

/*! @name SMISTAT - SMI Status */
/*! @{ */

#define TENBASET_PHY_SMISTAT_READY_MASK          (0x1U)
#define TENBASET_PHY_SMISTAT_READY_SHIFT         (0U)
/*! READY - Ready
 *  0b0..No
 *  0b1..Yes
 */
#define TENBASET_PHY_SMISTAT_READY(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMISTAT_READY_SHIFT)) & TENBASET_PHY_SMISTAT_READY_MASK)

#define TENBASET_PHY_SMISTAT_ERRCODE_MASK        (0xEU)
#define TENBASET_PHY_SMISTAT_ERRCODE_SHIFT       (1U)
/*! ERRCODE - Error Code
 *  0b000..NONE
 *  0b001..NONTC14
 *  0b010..Disabled
 *  0b011..ABORTED
 *  0b100..INPRGS
 */
#define TENBASET_PHY_SMISTAT_ERRCODE(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMISTAT_ERRCODE_SHIFT)) & TENBASET_PHY_SMISTAT_ERRCODE_MASK)
/*! @} */

/*! @name INTENCAPT1 - Interrupt Capture1 */
/*! @{ */

#define TENBASET_PHY_INTENCAPT1_PHYSCOL_MASK     (0x1U)
#define TENBASET_PHY_INTENCAPT1_PHYSCOL_SHIFT    (0U)
/*! PHYSCOL - Physical Collision
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT1_PHYSCOL(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT1_PHYSCOL_SHIFT)) & TENBASET_PHY_INTENCAPT1_PHYSCOL_MASK)

#define TENBASET_PHY_INTENCAPT1_PLCAREC_MASK     (0x2U)
#define TENBASET_PHY_INTENCAPT1_PLCAREC_SHIFT    (1U)
/*! PLCAREC - PLCA Recovery
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT1_PLCAREC(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT1_PLCAREC_SHIFT)) & TENBASET_PHY_INTENCAPT1_PLCAREC_MASK)

#define TENBASET_PHY_INTENCAPT1_PLCASTAT_MASK    (0x4U)
#define TENBASET_PHY_INTENCAPT1_PLCASTAT_SHIFT   (2U)
/*! PLCASTAT - PLCA Status
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT1_PLCASTAT(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT1_PLCASTAT_SHIFT)) & TENBASET_PHY_INTENCAPT1_PLCASTAT_MASK)

#define TENBASET_PHY_INTENCAPT1_MODESTAT_MASK    (0x8U)
#define TENBASET_PHY_INTENCAPT1_MODESTAT_SHIFT   (3U)
/*! MODESTAT - MODE Status
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT1_MODESTAT(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT1_MODESTAT_SHIFT)) & TENBASET_PHY_INTENCAPT1_MODESTAT_MASK)

#define TENBASET_PHY_INTENCAPT1_INVLDAPB_MASK    (0x10U)
#define TENBASET_PHY_INTENCAPT1_INVLDAPB_SHIFT   (4U)
/*! INVLDAPB - Invalid APB
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT1_INVLDAPB(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT1_INVLDAPB_SHIFT)) & TENBASET_PHY_INTENCAPT1_INVLDAPB_MASK)

#define TENBASET_PHY_INTENCAPT1_LOCJAB_MASK      (0x20U)
#define TENBASET_PHY_INTENCAPT1_LOCJAB_SHIFT     (5U)
/*! LOCJAB - Local Jabber
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT1_LOCJAB(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT1_LOCJAB_SHIFT)) & TENBASET_PHY_INTENCAPT1_LOCJAB_MASK)

#define TENBASET_PHY_INTENCAPT1_REMJAB_MASK      (0x40U)
#define TENBASET_PHY_INTENCAPT1_REMJAB_SHIFT     (6U)
/*! REMJAB - Remote Jabber
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT1_REMJAB(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT1_REMJAB_SHIFT)) & TENBASET_PHY_INTENCAPT1_REMJAB_MASK)

#define TENBASET_PHY_INTENCAPT1_PINFAULT_MASK    (0x80U)
#define TENBASET_PHY_INTENCAPT1_PINFAULT_SHIFT   (7U)
/*! PINFAULT - PIN Fault Monitor
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT1_PINFAULT(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT1_PINFAULT_SHIFT)) & TENBASET_PHY_INTENCAPT1_PINFAULT_MASK)

#define TENBASET_PHY_INTENCAPT1_PLCADIAG_MASK    (0x100U)
#define TENBASET_PHY_INTENCAPT1_PLCADIAG_SHIFT   (8U)
/*! PLCADIAG - PLCA Diagnostics
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT1_PLCADIAG(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT1_PLCADIAG_SHIFT)) & TENBASET_PHY_INTENCAPT1_PLCADIAG_MASK)

#define TENBASET_PHY_INTENCAPT1_SMIACCESS_MASK   (0x200U)
#define TENBASET_PHY_INTENCAPT1_SMIACCESS_SHIFT  (9U)
/*! SMIACCESS - SMI Access
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT1_SMIACCESS(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT1_SMIACCESS_SHIFT)) & TENBASET_PHY_INTENCAPT1_SMIACCESS_MASK)

#define TENBASET_PHY_INTENCAPT1_LCLWK_MASK       (0x400U)
#define TENBASET_PHY_INTENCAPT1_LCLWK_SHIFT      (10U)
/*! LCLWK - Local Wake
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT1_LCLWK(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT1_LCLWK_SHIFT)) & TENBASET_PHY_INTENCAPT1_LCLWK_MASK)

#define TENBASET_PHY_INTENCAPT1_SSPDET_MASK      (0x800U)
#define TENBASET_PHY_INTENCAPT1_SSPDET_SHIFT     (11U)
/*! SSPDET - Suspend Symbol Detects
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT1_SSPDET(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT1_SSPDET_SHIFT)) & TENBASET_PHY_INTENCAPT1_SSPDET_MASK)

#define TENBASET_PHY_INTENCAPT1_WUTDET_MASK      (0x1000U)
#define TENBASET_PHY_INTENCAPT1_WUTDET_SHIFT     (12U)
/*! WUTDET - WUT Detect
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT1_WUTDET(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT1_WUTDET_SHIFT)) & TENBASET_PHY_INTENCAPT1_WUTDET_MASK)

#define TENBASET_PHY_INTENCAPT1_WUPDONE_MASK     (0x2000U)
#define TENBASET_PHY_INTENCAPT1_WUPDONE_SHIFT    (13U)
/*! WUPDONE - WUP transmission completed Write 1 clears bits.
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT1_WUPDONE(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT1_WUPDONE_SHIFT)) & TENBASET_PHY_INTENCAPT1_WUPDONE_MASK)

#define TENBASET_PHY_INTENCAPT1_APBPARITY_MASK   (0x4000U)
#define TENBASET_PHY_INTENCAPT1_APBPARITY_SHIFT  (14U)
/*! APBPARITY - APB Parity
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT1_APBPARITY(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT1_APBPARITY_SHIFT)) & TENBASET_PHY_INTENCAPT1_APBPARITY_MASK)
/*! @} */

/*! @name INTENSET1 - Interrupt Enable Set1 */
/*! @{ */

#define TENBASET_PHY_INTENSET1_PHYSCOL_MASK      (0x1U)
#define TENBASET_PHY_INTENSET1_PHYSCOL_SHIFT     (0U)
/*! PHYSCOL - write 1 enables corresponding interrupt
 *  0b0..Disabled
 *  0b1..ENABLED
 */
#define TENBASET_PHY_INTENSET1_PHYSCOL(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET1_PHYSCOL_SHIFT)) & TENBASET_PHY_INTENSET1_PHYSCOL_MASK)

#define TENBASET_PHY_INTENSET1_PLCAREC_MASK      (0x2U)
#define TENBASET_PHY_INTENSET1_PLCAREC_SHIFT     (1U)
/*! PLCAREC - write 1 enables corresponding interrupt
 *  0b0..Disabled
 *  0b1..ENABLED
 */
#define TENBASET_PHY_INTENSET1_PLCAREC(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET1_PLCAREC_SHIFT)) & TENBASET_PHY_INTENSET1_PLCAREC_MASK)

