zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TENBASET_PHY.h
#define TENBASET_PHY_INTENCLR1_INVLDAPB_MASK     (0x10U)
#define TENBASET_PHY_INTENCLR1_INVLDAPB_SHIFT    (4U)
/*! INVLDAPB - write 1 disables corresponding interrupt
 *  0b0..NO_EFFECT
 *  0b1..DISABLE
 */
#define TENBASET_PHY_INTENCLR1_INVLDAPB(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR1_INVLDAPB_SHIFT)) & TENBASET_PHY_INTENCLR1_INVLDAPB_MASK)

#define TENBASET_PHY_INTENCLR1_LOCJAB_MASK       (0x20U)
#define TENBASET_PHY_INTENCLR1_LOCJAB_SHIFT      (5U)
/*! LOCJAB - write 1 disables corresponding interrupt
 *  0b0..NO_EFFECT
 *  0b1..DISABLE
 */
#define TENBASET_PHY_INTENCLR1_LOCJAB(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR1_LOCJAB_SHIFT)) & TENBASET_PHY_INTENCLR1_LOCJAB_MASK)

#define TENBASET_PHY_INTENCLR1_REMJAB_MASK       (0x40U)
#define TENBASET_PHY_INTENCLR1_REMJAB_SHIFT      (6U)
/*! REMJAB - write 1 disables corresponding interrupt
 *  0b0..NO_EFFECT
 *  0b1..DISABLE
 */
#define TENBASET_PHY_INTENCLR1_REMJAB(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR1_REMJAB_SHIFT)) & TENBASET_PHY_INTENCLR1_REMJAB_MASK)

#define TENBASET_PHY_INTENCLR1_PINFAULT_MASK     (0x80U)
#define TENBASET_PHY_INTENCLR1_PINFAULT_SHIFT    (7U)
/*! PINFAULT - write 1 disables corresponding interrupt
 *  0b0..NO_EFFECT
 *  0b1..DISABLE
 */
#define TENBASET_PHY_INTENCLR1_PINFAULT(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR1_PINFAULT_SHIFT)) & TENBASET_PHY_INTENCLR1_PINFAULT_MASK)

#define TENBASET_PHY_INTENCLR1_PLCADIAG_MASK     (0x100U)
#define TENBASET_PHY_INTENCLR1_PLCADIAG_SHIFT    (8U)
/*! PLCADIAG - write 1 disables corresponding interrupt
 *  0b0..NO_EFFECT
 *  0b1..DISABLE
 */
#define TENBASET_PHY_INTENCLR1_PLCADIAG(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR1_PLCADIAG_SHIFT)) & TENBASET_PHY_INTENCLR1_PLCADIAG_MASK)

#define TENBASET_PHY_INTENCLR1_SMIACCESS_MASK    (0x200U)
#define TENBASET_PHY_INTENCLR1_SMIACCESS_SHIFT   (9U)
/*! SMIACCESS - write 1 disables corresponding interrupt
 *  0b0..NO_EFFECT
 *  0b1..DISABLE
 */
#define TENBASET_PHY_INTENCLR1_SMIACCESS(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR1_SMIACCESS_SHIFT)) & TENBASET_PHY_INTENCLR1_SMIACCESS_MASK)

#define TENBASET_PHY_INTENCLR1_LCLWK_MASK        (0x400U)
#define TENBASET_PHY_INTENCLR1_LCLWK_SHIFT       (10U)
/*! LCLWK - write 1 disables corresponding interrupt
 *  0b0..NO_EFFECT
 *  0b1..DISABLE
 */
#define TENBASET_PHY_INTENCLR1_LCLWK(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR1_LCLWK_SHIFT)) & TENBASET_PHY_INTENCLR1_LCLWK_MASK)

#define TENBASET_PHY_INTENCLR1_SSPDET_MASK       (0x800U)
#define TENBASET_PHY_INTENCLR1_SSPDET_SHIFT      (11U)
/*! SSPDET - write 1 disables corresponding interrupt
 *  0b0..NO_EFFECT
 *  0b1..DISABLE
 */
#define TENBASET_PHY_INTENCLR1_SSPDET(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR1_SSPDET_SHIFT)) & TENBASET_PHY_INTENCLR1_SSPDET_MASK)

#define TENBASET_PHY_INTENCLR1_WUTDET_MASK       (0x1000U)
#define TENBASET_PHY_INTENCLR1_WUTDET_SHIFT      (12U)
/*! WUTDET - write 1 disables corresponding interrupt
 *  0b0..NO_EFFECT
 *  0b1..DISABLE
 */
#define TENBASET_PHY_INTENCLR1_WUTDET(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR1_WUTDET_SHIFT)) & TENBASET_PHY_INTENCLR1_WUTDET_MASK)

#define TENBASET_PHY_INTENCLR1_WUPDONE_MASK      (0x2000U)
#define TENBASET_PHY_INTENCLR1_WUPDONE_SHIFT     (13U)
/*! WUPDONE - write 1 disables corresponding interrupt
 *  0b0..NO_EFFECT
 *  0b1..DISABLE
 */
#define TENBASET_PHY_INTENCLR1_WUPDONE(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR1_WUPDONE_SHIFT)) & TENBASET_PHY_INTENCLR1_WUPDONE_MASK)

#define TENBASET_PHY_INTENCLR1_APBPARITY_MASK    (0x4000U)
#define TENBASET_PHY_INTENCLR1_APBPARITY_SHIFT   (14U)
/*! APBPARITY - write 1 disables corresponding interrupt
 *  0b0..NO_EFFECT
 *  0b1..DISABLE
 */
#define TENBASET_PHY_INTENCLR1_APBPARITY(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR1_APBPARITY_SHIFT)) & TENBASET_PHY_INTENCLR1_APBPARITY_MASK)
/*! @} */

/*! @name INTSTAT1 - Interrupt Status1 */
/*! @{ */

#define TENBASET_PHY_INTSTAT1_PHYSCOL_MASK       (0x1U)
#define TENBASET_PHY_INTSTAT1_PHYSCOL_SHIFT      (0U)
/*! PHYSCOL - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT1_PHYSCOL(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT1_PHYSCOL_SHIFT)) & TENBASET_PHY_INTSTAT1_PHYSCOL_MASK)

#define TENBASET_PHY_INTSTAT1_PLCAREC_MASK       (0x2U)
#define TENBASET_PHY_INTSTAT1_PLCAREC_SHIFT      (1U)
/*! PLCAREC - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT1_PLCAREC(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT1_PLCAREC_SHIFT)) & TENBASET_PHY_INTSTAT1_PLCAREC_MASK)

#define TENBASET_PHY_INTSTAT1_PLCASTAT_MASK      (0x4U)
#define TENBASET_PHY_INTSTAT1_PLCASTAT_SHIFT     (2U)
/*! PLCASTAT - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT1_PLCASTAT(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT1_PLCASTAT_SHIFT)) & TENBASET_PHY_INTSTAT1_PLCASTAT_MASK)

#define TENBASET_PHY_INTSTAT1_MODESTAT_MASK      (0x8U)
#define TENBASET_PHY_INTSTAT1_MODESTAT_SHIFT     (3U)
/*! MODESTAT - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT1_MODESTAT(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT1_MODESTAT_SHIFT)) & TENBASET_PHY_INTSTAT1_MODESTAT_MASK)

#define TENBASET_PHY_INTSTAT1_INVLDAPB_MASK      (0x10U)
#define TENBASET_PHY_INTSTAT1_INVLDAPB_SHIFT     (4U)
/*! INVLDAPB - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT1_INVLDAPB(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT1_INVLDAPB_SHIFT)) & TENBASET_PHY_INTSTAT1_INVLDAPB_MASK)

#define TENBASET_PHY_INTSTAT1_LOCJAB_MASK        (0x20U)
#define TENBASET_PHY_INTSTAT1_LOCJAB_SHIFT       (5U)
/*! LOCJAB - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT1_LOCJAB(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT1_LOCJAB_SHIFT)) & TENBASET_PHY_INTSTAT1_LOCJAB_MASK)

#define TENBASET_PHY_INTSTAT1_REMJAB_MASK        (0x40U)
#define TENBASET_PHY_INTSTAT1_REMJAB_SHIFT       (6U)
/*! REMJAB - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT1_REMJAB(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT1_REMJAB_SHIFT)) & TENBASET_PHY_INTSTAT1_REMJAB_MASK)

#define TENBASET_PHY_INTSTAT1_PINFAULT_MASK      (0x80U)
#define TENBASET_PHY_INTSTAT1_PINFAULT_SHIFT     (7U)
/*! PINFAULT - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT1_PINFAULT(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT1_PINFAULT_SHIFT)) & TENBASET_PHY_INTSTAT1_PINFAULT_MASK)

