zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TENBASET_PHY.h
#define TENBASET_PHY_INTSTAT1_PLCADIAG_MASK      (0x100U)
#define TENBASET_PHY_INTSTAT1_PLCADIAG_SHIFT     (8U)
/*! PLCADIAG - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT1_PLCADIAG(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT1_PLCADIAG_SHIFT)) & TENBASET_PHY_INTSTAT1_PLCADIAG_MASK)

#define TENBASET_PHY_INTSTAT1_SMIACCESS_MASK     (0x200U)
#define TENBASET_PHY_INTSTAT1_SMIACCESS_SHIFT    (9U)
/*! SMIACCESS - status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT1_SMIACCESS(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT1_SMIACCESS_SHIFT)) & TENBASET_PHY_INTSTAT1_SMIACCESS_MASK)

#define TENBASET_PHY_INTSTAT1_LCLWK_MASK         (0x400U)
#define TENBASET_PHY_INTSTAT1_LCLWK_SHIFT        (10U)
/*! LCLWK - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT1_LCLWK(x)           (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT1_LCLWK_SHIFT)) & TENBASET_PHY_INTSTAT1_LCLWK_MASK)

#define TENBASET_PHY_INTSTAT1_SSPDET_MASK        (0x800U)
#define TENBASET_PHY_INTSTAT1_SSPDET_SHIFT       (11U)
/*! SSPDET - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT1_SSPDET(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT1_SSPDET_SHIFT)) & TENBASET_PHY_INTSTAT1_SSPDET_MASK)

#define TENBASET_PHY_INTSTAT1_WUTDET_MASK        (0x1000U)
#define TENBASET_PHY_INTSTAT1_WUTDET_SHIFT       (12U)
/*! WUTDET - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT1_WUTDET(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT1_WUTDET_SHIFT)) & TENBASET_PHY_INTSTAT1_WUTDET_MASK)

#define TENBASET_PHY_INTSTAT1_WUPDONE_MASK       (0x2000U)
#define TENBASET_PHY_INTSTAT1_WUPDONE_SHIFT      (13U)
/*! WUPDONE - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT1_WUPDONE(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT1_WUPDONE_SHIFT)) & TENBASET_PHY_INTSTAT1_WUPDONE_MASK)

#define TENBASET_PHY_INTSTAT1_APBPARITY_MASK     (0x4000U)
#define TENBASET_PHY_INTSTAT1_APBPARITY_SHIFT    (14U)
/*! APBPARITY - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT1_APBPARITY(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT1_APBPARITY_SHIFT)) & TENBASET_PHY_INTSTAT1_APBPARITY_MASK)
/*! @} */

/*! @name INTENCAPT2 - Interrupt Capture2 */
/*! @{ */

#define TENBASET_PHY_INTENCAPT2_PHYSCOL_MASK     (0x1U)
#define TENBASET_PHY_INTENCAPT2_PHYSCOL_SHIFT    (0U)
/*! PHYSCOL - Physical Collision
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT2_PHYSCOL(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT2_PHYSCOL_SHIFT)) & TENBASET_PHY_INTENCAPT2_PHYSCOL_MASK)

#define TENBASET_PHY_INTENCAPT2_PLCAREC_MASK     (0x2U)
#define TENBASET_PHY_INTENCAPT2_PLCAREC_SHIFT    (1U)
/*! PLCAREC - PLCA Recovery
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT2_PLCAREC(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT2_PLCAREC_SHIFT)) & TENBASET_PHY_INTENCAPT2_PLCAREC_MASK)

#define TENBASET_PHY_INTENCAPT2_PLCASTAT_MASK    (0x4U)
#define TENBASET_PHY_INTENCAPT2_PLCASTAT_SHIFT   (2U)
/*! PLCASTAT - PLCA Status
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT2_PLCASTAT(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT2_PLCASTAT_SHIFT)) & TENBASET_PHY_INTENCAPT2_PLCASTAT_MASK)

#define TENBASET_PHY_INTENCAPT2_MODESTAT_MASK    (0x8U)
#define TENBASET_PHY_INTENCAPT2_MODESTAT_SHIFT   (3U)
/*! MODESTAT - MODE Status
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT2_MODESTAT(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT2_MODESTAT_SHIFT)) & TENBASET_PHY_INTENCAPT2_MODESTAT_MASK)

#define TENBASET_PHY_INTENCAPT2_INVLDAPB_MASK    (0x10U)
#define TENBASET_PHY_INTENCAPT2_INVLDAPB_SHIFT   (4U)
/*! INVLDAPB - Invalid APB
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT2_INVLDAPB(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT2_INVLDAPB_SHIFT)) & TENBASET_PHY_INTENCAPT2_INVLDAPB_MASK)

#define TENBASET_PHY_INTENCAPT2_LOCJAB_MASK      (0x20U)
#define TENBASET_PHY_INTENCAPT2_LOCJAB_SHIFT     (5U)
/*! LOCJAB - Local Jabber
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT2_LOCJAB(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT2_LOCJAB_SHIFT)) & TENBASET_PHY_INTENCAPT2_LOCJAB_MASK)

#define TENBASET_PHY_INTENCAPT2_REMJAB_MASK      (0x40U)
#define TENBASET_PHY_INTENCAPT2_REMJAB_SHIFT     (6U)
/*! REMJAB - Remote Jabber
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT2_REMJAB(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT2_REMJAB_SHIFT)) & TENBASET_PHY_INTENCAPT2_REMJAB_MASK)

#define TENBASET_PHY_INTENCAPT2_PINFAULT_MASK    (0x80U)
#define TENBASET_PHY_INTENCAPT2_PINFAULT_SHIFT   (7U)
/*! PINFAULT - PIN Fault Monitor
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT2_PINFAULT(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT2_PINFAULT_SHIFT)) & TENBASET_PHY_INTENCAPT2_PINFAULT_MASK)

#define TENBASET_PHY_INTENCAPT2_PLCADIAG_MASK    (0x100U)
#define TENBASET_PHY_INTENCAPT2_PLCADIAG_SHIFT   (8U)
/*! PLCADIAG - PLCA Diagnostics
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT2_PLCADIAG(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT2_PLCADIAG_SHIFT)) & TENBASET_PHY_INTENCAPT2_PLCADIAG_MASK)

#define TENBASET_PHY_INTENCAPT2_SMIACCESS_MASK   (0x200U)
#define TENBASET_PHY_INTENCAPT2_SMIACCESS_SHIFT  (9U)
/*! SMIACCESS - SMI Access
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT2_SMIACCESS(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT2_SMIACCESS_SHIFT)) & TENBASET_PHY_INTENCAPT2_SMIACCESS_MASK)

#define TENBASET_PHY_INTENCAPT2_LCLWK_MASK       (0x400U)
#define TENBASET_PHY_INTENCAPT2_LCLWK_SHIFT      (10U)
/*! LCLWK - Local Wake
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT2_LCLWK(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT2_LCLWK_SHIFT)) & TENBASET_PHY_INTENCAPT2_LCLWK_MASK)

