zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TENBASET_PHY.h
#define TENBASET_PHY_INTENCAPT2_SSPDET_MASK      (0x800U)
#define TENBASET_PHY_INTENCAPT2_SSPDET_SHIFT     (11U)
/*! SSPDET - Suspend Symbol Detects
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT2_SSPDET(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT2_SSPDET_SHIFT)) & TENBASET_PHY_INTENCAPT2_SSPDET_MASK)

#define TENBASET_PHY_INTENCAPT2_WUTDET_MASK      (0x1000U)
#define TENBASET_PHY_INTENCAPT2_WUTDET_SHIFT     (12U)
/*! WUTDET - WUT Detect
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT2_WUTDET(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT2_WUTDET_SHIFT)) & TENBASET_PHY_INTENCAPT2_WUTDET_MASK)

#define TENBASET_PHY_INTENCAPT2_WUPDONE_MASK     (0x2000U)
#define TENBASET_PHY_INTENCAPT2_WUPDONE_SHIFT    (13U)
/*! WUPDONE - WUP transmission completed Write 1 clears bits.
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT2_WUPDONE(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT2_WUPDONE_SHIFT)) & TENBASET_PHY_INTENCAPT2_WUPDONE_MASK)

#define TENBASET_PHY_INTENCAPT2_APBPARITY_MASK   (0x4000U)
#define TENBASET_PHY_INTENCAPT2_APBPARITY_SHIFT  (14U)
/*! APBPARITY - APB Parity
 *  0b0..NO Effect
 *  0b1..Clear
 */
#define TENBASET_PHY_INTENCAPT2_APBPARITY(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCAPT2_APBPARITY_SHIFT)) & TENBASET_PHY_INTENCAPT2_APBPARITY_MASK)
/*! @} */

/*! @name INTENSET2 - Interrupt Enable Set1 */
/*! @{ */

#define TENBASET_PHY_INTENSET2_PHYSCOL_MASK      (0x1U)
#define TENBASET_PHY_INTENSET2_PHYSCOL_SHIFT     (0U)
/*! PHYSCOL - write 1 enables corresponding interrupt
 *  0b0..Disabled
 *  0b1..ENABLED
 */
#define TENBASET_PHY_INTENSET2_PHYSCOL(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_PHYSCOL_SHIFT)) & TENBASET_PHY_INTENSET2_PHYSCOL_MASK)

#define TENBASET_PHY_INTENSET2_PLCAREC_MASK      (0x2U)
#define TENBASET_PHY_INTENSET2_PLCAREC_SHIFT     (1U)
/*! PLCAREC - write 1 enables corresponding interrupt
 *  0b0..Disabled
 *  0b1..ENABLED
 */
#define TENBASET_PHY_INTENSET2_PLCAREC(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_PLCAREC_SHIFT)) & TENBASET_PHY_INTENSET2_PLCAREC_MASK)

#define TENBASET_PHY_INTENSET2_PLCASTAT_MASK     (0x4U)
#define TENBASET_PHY_INTENSET2_PLCASTAT_SHIFT    (2U)
/*! PLCASTAT - write 1 enables corresponding interrupt
 *  0b0..Disabled
 *  0b1..ENABLED
 */
#define TENBASET_PHY_INTENSET2_PLCASTAT(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_PLCASTAT_SHIFT)) & TENBASET_PHY_INTENSET2_PLCASTAT_MASK)

#define TENBASET_PHY_INTENSET2_MODESTAT_MASK     (0x8U)
#define TENBASET_PHY_INTENSET2_MODESTAT_SHIFT    (3U)
/*! MODESTAT - Mode status
 *  0b0..Disabled
 *  0b1..ENABLED
 */
#define TENBASET_PHY_INTENSET2_MODESTAT(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_MODESTAT_SHIFT)) & TENBASET_PHY_INTENSET2_MODESTAT_MASK)

#define TENBASET_PHY_INTENSET2_INVLDAPB_MASK     (0x10U)
#define TENBASET_PHY_INTENSET2_INVLDAPB_SHIFT    (4U)
/*! INVLDAPB - write 1 enables corresponding interrupt
 *  0b0..Disabled
 *  0b1..ENABLED
 */
#define TENBASET_PHY_INTENSET2_INVLDAPB(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_INVLDAPB_SHIFT)) & TENBASET_PHY_INTENSET2_INVLDAPB_MASK)

#define TENBASET_PHY_INTENSET2_LOCJAB_MASK       (0x20U)
#define TENBASET_PHY_INTENSET2_LOCJAB_SHIFT      (5U)
/*! LOCJAB - write 1 enables corresponding interrupt
 *  0b0..Disabled
 *  0b1..ENABLED
 */
#define TENBASET_PHY_INTENSET2_LOCJAB(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_LOCJAB_SHIFT)) & TENBASET_PHY_INTENSET2_LOCJAB_MASK)

#define TENBASET_PHY_INTENSET2_REMJAB_MASK       (0x40U)
#define TENBASET_PHY_INTENSET2_REMJAB_SHIFT      (6U)
/*! REMJAB - write 1 enables corresponding interrupt
 *  0b0..Disabled
 *  0b1..ENABLED
 */
#define TENBASET_PHY_INTENSET2_REMJAB(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_REMJAB_SHIFT)) & TENBASET_PHY_INTENSET2_REMJAB_MASK)

#define TENBASET_PHY_INTENSET2_PINFAULT_MASK     (0x80U)
#define TENBASET_PHY_INTENSET2_PINFAULT_SHIFT    (7U)
/*! PINFAULT - write 1 enables corresponding interrupt
 *  0b0..Disabled
 *  0b1..ENABLED
 */
#define TENBASET_PHY_INTENSET2_PINFAULT(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_PINFAULT_SHIFT)) & TENBASET_PHY_INTENSET2_PINFAULT_MASK)

#define TENBASET_PHY_INTENSET2_PLCADIAG_MASK     (0x100U)
#define TENBASET_PHY_INTENSET2_PLCADIAG_SHIFT    (8U)
/*! PLCADIAG - write 1 enables corresponding interrupt
 *  0b0..Disabled
 *  0b1..ENABLED
 */
#define TENBASET_PHY_INTENSET2_PLCADIAG(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_PLCADIAG_SHIFT)) & TENBASET_PHY_INTENSET2_PLCADIAG_MASK)

#define TENBASET_PHY_INTENSET2_SMIACCESS_MASK    (0x200U)
#define TENBASET_PHY_INTENSET2_SMIACCESS_SHIFT   (9U)
/*! SMIACCESS - write 1 enables corresponding interrupt
 *  0b0..Disabled
 *  0b1..ENABLED
 */
#define TENBASET_PHY_INTENSET2_SMIACCESS(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_SMIACCESS_SHIFT)) & TENBASET_PHY_INTENSET2_SMIACCESS_MASK)

#define TENBASET_PHY_INTENSET2_LCLWK_MASK        (0x400U)
#define TENBASET_PHY_INTENSET2_LCLWK_SHIFT       (10U)
/*! LCLWK - write 1 enables corresponding interrupt
 *  0b0..Disabled
 *  0b1..ENABLED
 */
#define TENBASET_PHY_INTENSET2_LCLWK(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_LCLWK_SHIFT)) & TENBASET_PHY_INTENSET2_LCLWK_MASK)

#define TENBASET_PHY_INTENSET2_SSPDET_MASK       (0x800U)
#define TENBASET_PHY_INTENSET2_SSPDET_SHIFT      (11U)
/*! SSPDET - write 1 enables corresponding interrupt
 *  0b0..Disabled
 *  0b1..ENABLED
 */
#define TENBASET_PHY_INTENSET2_SSPDET(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_SSPDET_SHIFT)) & TENBASET_PHY_INTENSET2_SSPDET_MASK)

#define TENBASET_PHY_INTENSET2_WUTDET_MASK       (0x1000U)
#define TENBASET_PHY_INTENSET2_WUTDET_SHIFT      (12U)
/*! WUTDET - write 1 enables corresponding interrupt
 *  0b0..Disabled
 *  0b1..ENABLED
 */
#define TENBASET_PHY_INTENSET2_WUTDET(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_WUTDET_SHIFT)) & TENBASET_PHY_INTENSET2_WUTDET_MASK)

#define TENBASET_PHY_INTENSET2_WUPDONE_MASK      (0x2000U)
#define TENBASET_PHY_INTENSET2_WUPDONE_SHIFT     (13U)
/*! WUPDONE - write 1 enables corresponding interrupt
 *  0b0..Disabled
 *  0b1..ENABLED
 */
#define TENBASET_PHY_INTENSET2_WUPDONE(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_WUPDONE_SHIFT)) & TENBASET_PHY_INTENSET2_WUPDONE_MASK)

#define TENBASET_PHY_INTENSET2_APBPARITY_MASK    (0x4000U)
#define TENBASET_PHY_INTENSET2_APBPARITY_SHIFT   (14U)
/*! APBPARITY - write 1 enables corresponding interrupt
 *  0b0..Disabled
 *  0b1..ENABLED
 */
#define TENBASET_PHY_INTENSET2_APBPARITY(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_APBPARITY_SHIFT)) & TENBASET_PHY_INTENSET2_APBPARITY_MASK)
/*! @} */

/*! @name INTENCLR2 - Interrupt Enable Clear2 */
/*! @{ */

