zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TENBASET_PHY.h
#define TENBASET_PHY_INTSTAT2_LOCJAB_MASK        (0x20U)
#define TENBASET_PHY_INTSTAT2_LOCJAB_SHIFT       (5U)
/*! LOCJAB - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT2_LOCJAB(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT2_LOCJAB_SHIFT)) & TENBASET_PHY_INTSTAT2_LOCJAB_MASK)

#define TENBASET_PHY_INTSTAT2_REMJAB_MASK        (0x40U)
#define TENBASET_PHY_INTSTAT2_REMJAB_SHIFT       (6U)
/*! REMJAB - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT2_REMJAB(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT2_REMJAB_SHIFT)) & TENBASET_PHY_INTSTAT2_REMJAB_MASK)

#define TENBASET_PHY_INTSTAT2_PINFAULT_MASK      (0x80U)
#define TENBASET_PHY_INTSTAT2_PINFAULT_SHIFT     (7U)
/*! PINFAULT - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT2_PINFAULT(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT2_PINFAULT_SHIFT)) & TENBASET_PHY_INTSTAT2_PINFAULT_MASK)

#define TENBASET_PHY_INTSTAT2_PLCADIAG_MASK      (0x100U)
#define TENBASET_PHY_INTSTAT2_PLCADIAG_SHIFT     (8U)
/*! PLCADIAG - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT2_PLCADIAG(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT2_PLCADIAG_SHIFT)) & TENBASET_PHY_INTSTAT2_PLCADIAG_MASK)

#define TENBASET_PHY_INTSTAT2_SMIACCESS_MASK     (0x200U)
#define TENBASET_PHY_INTSTAT2_SMIACCESS_SHIFT    (9U)
/*! SMIACCESS - status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT2_SMIACCESS(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT2_SMIACCESS_SHIFT)) & TENBASET_PHY_INTSTAT2_SMIACCESS_MASK)

#define TENBASET_PHY_INTSTAT2_LCLWK_MASK         (0x400U)
#define TENBASET_PHY_INTSTAT2_LCLWK_SHIFT        (10U)
/*! LCLWK - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT2_LCLWK(x)           (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT2_LCLWK_SHIFT)) & TENBASET_PHY_INTSTAT2_LCLWK_MASK)

#define TENBASET_PHY_INTSTAT2_SSPDET_MASK        (0x800U)
#define TENBASET_PHY_INTSTAT2_SSPDET_SHIFT       (11U)
/*! SSPDET - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT2_SSPDET(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT2_SSPDET_SHIFT)) & TENBASET_PHY_INTSTAT2_SSPDET_MASK)

#define TENBASET_PHY_INTSTAT2_WUTDET_MASK        (0x1000U)
#define TENBASET_PHY_INTSTAT2_WUTDET_SHIFT       (12U)
/*! WUTDET - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT2_WUTDET(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT2_WUTDET_SHIFT)) & TENBASET_PHY_INTSTAT2_WUTDET_MASK)

#define TENBASET_PHY_INTSTAT2_WUPDONE_MASK       (0x2000U)
#define TENBASET_PHY_INTSTAT2_WUPDONE_SHIFT      (13U)
/*! WUPDONE - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT2_WUPDONE(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT2_WUPDONE_SHIFT)) & TENBASET_PHY_INTSTAT2_WUPDONE_MASK)

#define TENBASET_PHY_INTSTAT2_APBPARITY_MASK     (0x4000U)
#define TENBASET_PHY_INTSTAT2_APBPARITY_SHIFT    (14U)
/*! APBPARITY - Status of corresponding interrupt after enable stage
 *  0b0..Not Pending
 *  0b1..Pending
 */
#define TENBASET_PHY_INTSTAT2_APBPARITY(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT2_APBPARITY_SHIFT)) & TENBASET_PHY_INTSTAT2_APBPARITY_MASK)
/*! @} */

/*! @name PLCADIAG1 - PLCA TC14 Adv diagnostics */
/*! @{ */

#define TENBASET_PHY_PLCADIAG1_BCNBFTO_MASK      (0x1U)
#define TENBASET_PHY_PLCADIAG1_BCNBFTO_SHIFT     (0U)
/*! BCNBFTO - Beacon Consecutive
 *  0b0..NO
 *  0b1..Yes
 */
#define TENBASET_PHY_PLCADIAG1_BCNBFTO(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCADIAG1_BCNBFTO_SHIFT)) & TENBASET_PHY_PLCADIAG1_BCNBFTO_MASK)

#define TENBASET_PHY_PLCADIAG1_UNEXPB_MASK       (0x2U)
#define TENBASET_PHY_PLCADIAG1_UNEXPB_SHIFT      (1U)
/*! UNEXPB - Unexpected Beacon
 *  0b0..NO
 *  0b1..Yes
 */
#define TENBASET_PHY_PLCADIAG1_UNEXPB(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCADIAG1_UNEXPB_SHIFT)) & TENBASET_PHY_PLCADIAG1_UNEXPB_MASK)

#define TENBASET_PHY_PLCADIAG1_RXINTO_MASK       (0x4U)
#define TENBASET_PHY_PLCADIAG1_RXINTO_SHIFT      (2U)
/*! RXINTO - Indicates Reception
 *  0b0..NO
 *  0b1..Yes
 */
#define TENBASET_PHY_PLCADIAG1_RXINTO(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCADIAG1_RXINTO_SHIFT)) & TENBASET_PHY_PLCADIAG1_RXINTO_MASK)
/*! @} */

/*! @name PLCADIAG2 - PLCA NXP prop diagnostics */
/*! @{ */

#define TENBASET_PHY_PLCADIAG2_EARLYBCN_MASK     (0x1U)
#define TENBASET_PHY_PLCADIAG2_EARLYBCN_SHIFT    (0U)
/*! EARLYBCN - Early Beacon
 *  0b0..NO
 *  0b1..Yes
 */
#define TENBASET_PHY_PLCADIAG2_EARLYBCN(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCADIAG2_EARLYBCN_SHIFT)) & TENBASET_PHY_PLCADIAG2_EARLYBCN_MASK)

#define TENBASET_PHY_PLCADIAG2_LATEBCN_MASK      (0x2U)
#define TENBASET_PHY_PLCADIAG2_LATEBCN_SHIFT     (1U)
/*! LATEBCN - Late Beacon
 *  0b0..NO
 *  0b1..Yes
 */
#define TENBASET_PHY_PLCADIAG2_LATEBCN(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCADIAG2_LATEBCN_SHIFT)) & TENBASET_PHY_PLCADIAG2_LATEBCN_MASK)

#define TENBASET_PHY_PLCADIAG2_NORXBCN_MASK      (0x4U)
#define TENBASET_PHY_PLCADIAG2_NORXBCN_SHIFT     (2U)
/*! NORXBCN - No Beacon Received
 *  0b0..NO
 *  0b1..Yes
 */
#define TENBASET_PHY_PLCADIAG2_NORXBCN(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCADIAG2_NORXBCN_SHIFT)) & TENBASET_PHY_PLCADIAG2_NORXBCN_MASK)

#define TENBASET_PHY_PLCADIAG2_UNDEFSTATE_MASK   (0x8U)
#define TENBASET_PHY_PLCADIAG2_UNDEFSTATE_SHIFT  (3U)
/*! UNDEFSTATE - Undefined State
 *  0b0..NO
 *  0b1..Yes
 */
#define TENBASET_PHY_PLCADIAG2_UNDEFSTATE(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCADIAG2_UNDEFSTATE_SHIFT)) & TENBASET_PHY_PLCADIAG2_UNDEFSTATE_MASK)
/*! @} */

