zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TENBASET_PHY.h
/*! @name PLCADIAG3 - PLCA Beacon Counter Diagnostics */
/*! @{ */

#define TENBASET_PHY_PLCADIAG3_RXBCNTCNT_MASK    (0xFFFFU)
#define TENBASET_PHY_PLCADIAG3_RXBCNTCNT_SHIFT   (0U)
/*! RXBCNTCNT - RX Beacon Counter */
#define TENBASET_PHY_PLCADIAG3_RXBCNTCNT(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCADIAG3_RXBCNTCNT_SHIFT)) & TENBASET_PHY_PLCADIAG3_RXBCNTCNT_MASK)
/*! @} */

/*! @name PLCADIAG4 - PLCA TO Counter Diagnostics */
/*! @{ */

#define TENBASET_PHY_PLCADIAG4_TOCNT_MASK        (0xFFFFU)
#define TENBASET_PHY_PLCADIAG4_TOCNT_SHIFT       (0U)
/*! TOCNT - Transmit Opportunity Counter */
#define TENBASET_PHY_PLCADIAG4_TOCNT(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCADIAG4_TOCNT_SHIFT)) & TENBASET_PHY_PLCADIAG4_TOCNT_MASK)
/*! @} */

/*! @name TXCDIAG - Transceiver Diagnostics */
/*! @{ */

#define TENBASET_PHY_TXCDIAG_RXLOWFAIL_MASK      (0x1U)
#define TENBASET_PHY_TXCDIAG_RXLOWFAIL_SHIFT     (0U)
/*! RXLOWFAIL - RX Low Pin Detect
 *  0b0..NO
 *  0b1..Yes
 */
#define TENBASET_PHY_TXCDIAG_RXLOWFAIL(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_TXCDIAG_RXLOWFAIL_SHIFT)) & TENBASET_PHY_TXCDIAG_RXLOWFAIL_MASK)

#define TENBASET_PHY_TXCDIAG_RXHGHFAIL_MASK      (0x2U)
#define TENBASET_PHY_TXCDIAG_RXHGHFAIL_SHIFT     (1U)
/*! RXHGHFAIL - RX High Pin Detect
 *  0b0..NO
 *  0b1..Yes
 */
#define TENBASET_PHY_TXCDIAG_RXHGHFAIL(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_TXCDIAG_RXHGHFAIL_SHIFT)) & TENBASET_PHY_TXCDIAG_RXHGHFAIL_MASK)

#define TENBASET_PHY_TXCDIAG_EDLOWFAIL_MASK      (0x4U)
#define TENBASET_PHY_TXCDIAG_EDLOWFAIL_SHIFT     (2U)
/*! EDLOWFAIL - Stuck Low ED Pin
 *  0b0..NO
 *  0b1..Yes
 */
#define TENBASET_PHY_TXCDIAG_EDLOWFAIL(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_TXCDIAG_EDLOWFAIL_SHIFT)) & TENBASET_PHY_TXCDIAG_EDLOWFAIL_MASK)

#define TENBASET_PHY_TXCDIAG_EDHGHFAIL_MASK      (0x8U)
#define TENBASET_PHY_TXCDIAG_EDHGHFAIL_SHIFT     (3U)
/*! EDHGHFAIL - Stuck High ED Pin
 *  0b0..NO
 *  0b1..Yes
 */
#define TENBASET_PHY_TXCDIAG_EDHGHFAIL(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_TXCDIAG_EDHGHFAIL_SHIFT)) & TENBASET_PHY_TXCDIAG_EDHGHFAIL_MASK)

#define TENBASET_PHY_TXCDIAG_LPWRFAIL_MASK       (0x10U)
#define TENBASET_PHY_TXCDIAG_LPWRFAIL_SHIFT      (4U)
/*! LPWRFAIL - Low Power Failure
 *  0b0..NO
 *  0b1..Yes
 */
#define TENBASET_PHY_TXCDIAG_LPWRFAIL(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_TXCDIAG_LPWRFAIL_SHIFT)) & TENBASET_PHY_TXCDIAG_LPWRFAIL_MASK)
/*! @} */

/*! @name MSKPLCADIAG1 - Mask Control PLCADIAG1 Flag */
/*! @{ */

#define TENBASET_PHY_MSKPLCADIAG1_BCNBFTO_MASK   (0x1U)
#define TENBASET_PHY_MSKPLCADIAG1_BCNBFTO_SHIFT  (0U)
/*! BCNBFTO - Mask control for BCNBFTO flag
 *  0b0..Enabled
 *  0b1..Masked
 */
#define TENBASET_PHY_MSKPLCADIAG1_BCNBFTO(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKPLCADIAG1_BCNBFTO_SHIFT)) & TENBASET_PHY_MSKPLCADIAG1_BCNBFTO_MASK)

#define TENBASET_PHY_MSKPLCADIAG1_UNEXPB_MASK    (0x2U)
#define TENBASET_PHY_MSKPLCADIAG1_UNEXPB_SHIFT   (1U)
/*! UNEXPB - Mask control for UNEXPB flag
 *  0b0..Enabled
 *  0b1..Masked
 */
#define TENBASET_PHY_MSKPLCADIAG1_UNEXPB(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKPLCADIAG1_UNEXPB_SHIFT)) & TENBASET_PHY_MSKPLCADIAG1_UNEXPB_MASK)

#define TENBASET_PHY_MSKPLCADIAG1_RXINTO_MASK    (0x4U)
#define TENBASET_PHY_MSKPLCADIAG1_RXINTO_SHIFT   (2U)
/*! RXINTO - Mask control for RXINTO flag
 *  0b0..Enabled
 *  0b1..Masked
 */
#define TENBASET_PHY_MSKPLCADIAG1_RXINTO(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKPLCADIAG1_RXINTO_SHIFT)) & TENBASET_PHY_MSKPLCADIAG1_RXINTO_MASK)
/*! @} */

/*! @name MSKPLCADIAG2 - Mask Control PLCADIAG2 Flags */
/*! @{ */

#define TENBASET_PHY_MSKPLCADIAG2_EARLYBCN_MASK  (0x1U)
#define TENBASET_PHY_MSKPLCADIAG2_EARLYBCN_SHIFT (0U)
/*! EARLYBCN - Early Beacon Flag
 *  0b0..Enabled
 *  0b1..Masked
 */
#define TENBASET_PHY_MSKPLCADIAG2_EARLYBCN(x)    (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKPLCADIAG2_EARLYBCN_SHIFT)) & TENBASET_PHY_MSKPLCADIAG2_EARLYBCN_MASK)

#define TENBASET_PHY_MSKPLCADIAG2_LATEBCN_MASK   (0x2U)
#define TENBASET_PHY_MSKPLCADIAG2_LATEBCN_SHIFT  (1U)
/*! LATEBCN - Late Beacon
 *  0b0..Enabled
 *  0b1..Masked
 */
#define TENBASET_PHY_MSKPLCADIAG2_LATEBCN(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKPLCADIAG2_LATEBCN_SHIFT)) & TENBASET_PHY_MSKPLCADIAG2_LATEBCN_MASK)

#define TENBASET_PHY_MSKPLCADIAG2_NORXBCN_MASK   (0x4U)
#define TENBASET_PHY_MSKPLCADIAG2_NORXBCN_SHIFT  (2U)
/*! NORXBCN - NO RX Beacon
 *  0b0..Enabled
 *  0b1..Masked
 */
#define TENBASET_PHY_MSKPLCADIAG2_NORXBCN(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKPLCADIAG2_NORXBCN_SHIFT)) & TENBASET_PHY_MSKPLCADIAG2_NORXBCN_MASK)

#define TENBASET_PHY_MSKPLCADIAG2_UNDEFSTATE_MASK (0x8U)
#define TENBASET_PHY_MSKPLCADIAG2_UNDEFSTATE_SHIFT (3U)
/*! UNDEFSTATE - UNDEF State
 *  0b0..Enabled
 *  0b1..Masked
 */
#define TENBASET_PHY_MSKPLCADIAG2_UNDEFSTATE(x)  (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKPLCADIAG2_UNDEFSTATE_SHIFT)) & TENBASET_PHY_MSKPLCADIAG2_UNDEFSTATE_MASK)
/*! @} */

/*! @name MSKTXCDIAG - Mask Control TXCDIAG Flag */
/*! @{ */

#define TENBASET_PHY_MSKTXCDIAG_RXLOWFAIL_MASK   (0x1U)
#define TENBASET_PHY_MSKTXCDIAG_RXLOWFAIL_SHIFT  (0U)
/*! RXLOWFAIL - RX Low Fail
 *  0b0..Enabled
 *  0b1..Masked
 */
#define TENBASET_PHY_MSKTXCDIAG_RXLOWFAIL(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKTXCDIAG_RXLOWFAIL_SHIFT)) & TENBASET_PHY_MSKTXCDIAG_RXLOWFAIL_MASK)

#define TENBASET_PHY_MSKTXCDIAG_RXHGHFAIL_MASK   (0x2U)
#define TENBASET_PHY_MSKTXCDIAG_RXHGHFAIL_SHIFT  (1U)
/*! RXHGHFAIL - RX High Fail
 *  0b0..Enabled
 *  0b1..Masked
 */
#define TENBASET_PHY_MSKTXCDIAG_RXHGHFAIL(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKTXCDIAG_RXHGHFAIL_SHIFT)) & TENBASET_PHY_MSKTXCDIAG_RXHGHFAIL_MASK)

#define TENBASET_PHY_MSKTXCDIAG_EDLOWFAIL_MASK   (0x4U)
#define TENBASET_PHY_MSKTXCDIAG_EDLOWFAIL_SHIFT  (2U)
/*! EDLOWFAIL - ED Low Fail
 *  0b0..Enabled
 *  0b1..Masked
 */
#define TENBASET_PHY_MSKTXCDIAG_EDLOWFAIL(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKTXCDIAG_EDLOWFAIL_SHIFT)) & TENBASET_PHY_MSKTXCDIAG_EDLOWFAIL_MASK)

