zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TENBASET_PHY.h
#define TENBASET_PHY_MSKTXCDIAG_EDHGHFAIL_MASK   (0x8U)
#define TENBASET_PHY_MSKTXCDIAG_EDHGHFAIL_SHIFT  (3U)
/*! EDHGHFAIL - ED High Flag
 *  0b0..Enabled
 *  0b1..Masked
 */
#define TENBASET_PHY_MSKTXCDIAG_EDHGHFAIL(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKTXCDIAG_EDHGHFAIL_SHIFT)) & TENBASET_PHY_MSKTXCDIAG_EDHGHFAIL_MASK)

#define TENBASET_PHY_MSKTXCDIAG_LPWRFAIL_MASK    (0x10U)
#define TENBASET_PHY_MSKTXCDIAG_LPWRFAIL_SHIFT   (4U)
/*! LPWRFAIL - Low Power Fail
 *  0b0..Enabled
 *  0b1..Masked
 */
#define TENBASET_PHY_MSKTXCDIAG_LPWRFAIL(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKTXCDIAG_LPWRFAIL_SHIFT)) & TENBASET_PHY_MSKTXCDIAG_LPWRFAIL_MASK)
/*! @} */

/*! @name ACCESSCTRL - Global Access Control */
/*! @{ */

#define TENBASET_PHY_ACCESSCTRL_ACCESS_MASK      (0x1U)
#define TENBASET_PHY_ACCESSCTRL_ACCESS_SHIFT     (0U)
/*! ACCESS - APB Write Access
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define TENBASET_PHY_ACCESSCTRL_ACCESS(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_ACCESSCTRL_ACCESS_SHIFT)) & TENBASET_PHY_ACCESSCTRL_ACCESS_MASK)
/*! @} */

/*! @name DBGCTRL - Debug Control */
/*! @{ */

#define TENBASET_PHY_DBGCTRL_DEBUG_MASK          (0xFFU)
#define TENBASET_PHY_DBGCTRL_DEBUG_SHIFT         (0U)
/*! DEBUG - Debug */
#define TENBASET_PHY_DBGCTRL_DEBUG(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_DBGCTRL_DEBUG_SHIFT)) & TENBASET_PHY_DBGCTRL_DEBUG_MASK)
/*! @} */

/*! @name VERSION - Version Information */
/*! @{ */

#define TENBASET_PHY_VERSION_CUSTVER_MASK        (0xFU)
#define TENBASET_PHY_VERSION_CUSTVER_SHIFT       (0U)
/*! CUSTVER - Customer Version */
#define TENBASET_PHY_VERSION_CUSTVER(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_VERSION_CUSTVER_SHIFT)) & TENBASET_PHY_VERSION_CUSTVER_MASK)

#define TENBASET_PHY_VERSION_MINORVER_MASK       (0xFF0U)
#define TENBASET_PHY_VERSION_MINORVER_SHIFT      (4U)
/*! MINORVER - Minor Version */
#define TENBASET_PHY_VERSION_MINORVER(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_VERSION_MINORVER_SHIFT)) & TENBASET_PHY_VERSION_MINORVER_MASK)

#define TENBASET_PHY_VERSION_MAJORVER_MASK       (0xF000U)
#define TENBASET_PHY_VERSION_MAJORVER_SHIFT      (12U)
/*! MAJORVER - Major Version */
#define TENBASET_PHY_VERSION_MAJORVER(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_VERSION_MAJORVER_SHIFT)) & TENBASET_PHY_VERSION_MAJORVER_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group TENBASET_PHY_Register_Masks */


/*!
 * @}
 */ /* end of group TENBASET_PHY_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_TENBASET_PHY_H_ */

